IndiaAPI/Log/Amadeus/SkyBirdPriceVerify_VNS_BOM.txt

  :
---------------------------------------------Original Request12.02.55 PM 05-10-2024---------------------------------------------
{"adults":3,"child":0,"infants":0,"infantsWs":0,"flightResult":[{"ResultID":"gfs1","ResultIndex":"gfs1","Source":0,"valCarrier":"AI","Color":null,"gdsType":11,"IsLCC":false,"IsRefundable":false,"AirlineRemark":null,"Fare":{"FB_flight_id":0,"FB_static":"","tboResultIndex":null,"Tgy_FareID":null,"tjID":null,"refundType":0,"FareType":2,"mojoFareType":1,"cabinType":1,"bookingClass":null,"baggageInfo":null,"Currency":"INR","NetFare":107085.0,"PublishedFare":107085.0,"grandTotal":107085.0,"ShowFare":0.0,"BaseFare":80313.75,"Tax":26771.25,"YQTax":0.0,"AdditionalTxnFeePub":0.0,"AdditionalTxnFeeOfrd":0.0,"OtherCharges":0.0,"CommissionEarned":0.0,"PGCharge":0.0,"Discount":0.0,"OfferedFare":0.0,"TdsOnCommission":0.0,"TdsOnPLB":0.0,"TdsOnIncentive":0.0,"ServiceFee":0.0,"GST":0.0,"Markup":0.0,"fareBreakdown":[{"PassengerType":1,"BaseFare":26771.25,"Tax":8923.75,"YQTax":0.0,"AdditionalTxnFeePub":0.0,"AdditionalTxnFeeOfrd":0.0,"PGCharge":0.0,"Markup":0.0,"CommissionEarned":0.0,"TdsOnCommission":0.0,"GST":0.0,"ServiceFee":0.0,"OtherCharges":0.0,"Discount":0.0}],"markupID":null,"ffDiscount":0.0,"ConvenienceFee":0.0,"SeatAvailable":9,"isBlock":false,"gdsType":11,"subProvider":0,"scComprefare":0.0,"cgstax":0.0,"igstax":0.0,"sgstax":0.0,"flat":0.0,"additionalTxnFeeOfrd":0.0,"additionalTxnFeePub":0.0,"artGST":0.0,"artGSTOnMFee":0.0,"artTDS":0.0,"pLBEarned":0.0,"incentiveEarned":0.0,"artIncentive":0.0,"totalBaggageCharges":0.0,"totalMealCharges":0.0,"totalSeatCharges":0.0,"totalSpecialServiceCharges":0.0,"transactionFee":0.0,"managementFee":0.0,"cGSTax":0.0,"sGSTax":0.0,"iGSTax":0.0,"feeSurcharges":0.0,"instantDiscontOnFare":0.0,"publishedFareSoldInSwapping":0.0,"taxSoldInSwapping":0.0,"baseFareSoldInSwapping":0.0,"instantDiscountSoldInSwapping":0.0,"yqSoldInSwapping":0.0,"isFareSwapped":false,"ST_ResultSessionID":null,"AQ_ticket_id":null,"E2F_id":0,"d_owner":null,"FlightKey":null,"GFS_FlightKey":null},"FareList":[{"FB_flight_id":0,"FB_static":"","tboResultIndex":null,"Tgy_FareID":null,"tjID":null,"refundType":0,"FareType":2,"mojoFareType":1,"cabinType":1,"bookingClass":null,"baggageInfo":null,"Currency":"INR","NetFare":107085.0,"PublishedFare":107085.0,"grandTotal":107085.0,"ShowFare":0.0,"BaseFare":80313.75,"Tax":26771.25,"YQTax":0.0,"AdditionalTxnFeePub":0.0,"AdditionalTxnFeeOfrd":0.0,"OtherCharges":0.0,"CommissionEarned":0.0,"PGCharge":0.0,"Discount":0.0,"OfferedFare":0.0,"TdsOnCommission":0.0,"TdsOnPLB":0.0,"TdsOnIncentive":0.0,"ServiceFee":0.0,"GST":0.0,"Markup":0.0,"fareBreakdown":[{"PassengerType":1,"BaseFare":26771.25,"Tax":8923.75,"YQTax":0.0,"AdditionalTxnFeePub":0.0,"AdditionalTxnFeeOfrd":0.0,"PGCharge":0.0,"Markup":0.0,"CommissionEarned":0.0,"TdsOnCommission":0.0,"GST":0.0,"ServiceFee":0.0,"OtherCharges":0.0,"Discount":0.0}],"markupID":null,"ffDiscount":0.0,"ConvenienceFee":0.0,"SeatAvailable":9,"isBlock":false,"gdsType":11,"subProvider":0,"scComprefare":0.0,"cgstax":0.0,"igstax":0.0,"sgstax":0.0,"flat":0.0,"additionalTxnFeeOfrd":0.0,"additionalTxnFeePub":0.0,"artGST":0.0,"artGSTOnMFee":0.0,"artTDS":0.0,"pLBEarned":0.0,"incentiveEarned":0.0,"artIncentive":0.0,"totalBaggageCharges":0.0,"totalMealCharges":0.0,"totalSeatCharges":0.0,"totalSpecialServiceCharges":0.0,"transactionFee":0.0,"managementFee":0.0,"cGSTax":0.0,"sGSTax":0.0,"iGSTax":0.0,"feeSurcharges":0.0,"instantDiscontOnFare":0.0,"publishedFareSoldInSwapping":0.0,"taxSoldInSwapping":0.0,"baseFareSoldInSwapping":0.0,"instantDiscountSoldInSwapping":0.0,"yqSoldInSwapping":0.0,"isFareSwapped":false,"ST_ResultSessionID":null,"AQ_ticket_id":null,"E2F_id":0,"d_owner":null,"FlightKey":null,"GFS_FlightKey":null}],"FlightSegments":[{"Duration":145,"SegName":"Depart","stop":1,"LayoverTime":0,"Segments":[{"id":"0","SegmentIndicator":0,"Airline":"AI","FlightNumber":"696","equipmentType":"","FareClass":null,"OperatingCarrier":"AI","Origin":"VNS","DepTime":"2024-06-02T13:25:00","FromTerminal":"","Destination":"BOM","ArrTime":"2024-06-02T15:50:00","ToTerminal":"","CabinClass":1,"Duration":145,"layOverTime":0,"IsETicketEligible":false,"resDesignCode":"Y"}]}],"LastTicketDate":null,"TicketAdvisory":null,"cabinClass":1,"groupID":null,"isPreCuponAvailable":false,"ffResultIndex":null,"ffFareType":2,"ResultCombination":null,"Tgy_Flight_Id":null,"tgy_Flight_Key":null,"Tgy_Flight_No":null,"FB_InventoryFrom":null,"ST_ResultSessionID":null}]}
------------------------------------------------------



---------------------------------------------InformativeBestPricingWithoutPNRRequest12.02.55 PM 05-10-2024---------------------------------------------
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><add:MessageID xmlns:add="http://www.w3.org/2005/08/addressing">90ba8f24-99ed-4e8a-b397-17d1196928e6</add:MessageID><add:Action xmlns:add="http://www.w3.org/2005/08/addressing">http://webservices.amadeus.com/TIBNRQ_18_1_1A</add:Action><add:To xmlns:add="http://www.w3.org/2005/08/addressing">https://nodeD2.production.webservices.amadeus.com/1ASIWFMOFMJ</add:To><link:TransactionFlowLink xmlns:link="http://wsdl.amadeus.com/2010/06/ws/Link_v1" /><oas:Security xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:oas1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><oas:UsernameToken oas1:Id="UsernameToken-1"><oas:Username>WSFMJFMO</oas:Username><oas:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">dnBZUklkaWQ2dHUw</oas:Nonce><oas:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">ghhP2Dr8/1RrJ9Ng16j0tlc06I0=</oas:Password><oas1:Created>2024-05-10T06:32:55.993Z</oas1:Created></oas:UsernameToken></oas:Security><AMA_SecurityHostedUser xmlns="http://xml.amadeus.com/2010/06/Security_v1"><UserID AgentDutyCode="SU" RequestorType="U" PseudoCityCode="DELVS38LM" POS_Type="1" /></AMA_SecurityHostedUser></s:Header><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><Fare_InformativeBestPricingWithoutPNR xmlns="http://xml.amadeus.com/TIBNRQ_18_1_1A"> <passengersGroup><segmentRepetitionControl> <segmentControlDetails>	<quantity>1</quantity>	<numberOfUnits>3</numberOfUnits> </segmentControlDetails></segmentRepetitionControl> <travellersID> <travellerDetails> <measurementValue>1</measurementValue> </travellerDetails> <travellerDetails> <measurementValue>2</measurementValue> </travellerDetails> <travellerDetails> <measurementValue>3</measurementValue> </travellerDetails> </travellersID> <discountPtc>	<valueQualifier>ADT</valueQualifier> </discountPtc> </passengersGroup><segmentGroup> <segmentInformation>	<flightDate>	<departureDate>020624</departureDate>	</flightDate>	<boardPointDetails>	<trueLocationId>VNS</trueLocationId>	</boardPointDetails>	<offpointDetails>	<trueLocationId>BOM</trueLocationId>	</offpointDetails>	<companyDetails>	<marketingCompany>AI</marketingCompany>	</companyDetails>	<flightIdentification>	<flightNumber>696</flightNumber>	<bookingClass>Y</bookingClass>	</flightIdentification>    <flightTypeDetails>    <flightIndicator>1</flightIndicator>    </flightTypeDetails>    <itemNumber>1</itemNumber> </segmentInformation></segmentGroup>  <pricingOptionGroup>    <pricingOptionKey>      <pricingOptionKey>RP</pricingOptionKey>    </pricingOptionKey>  </pricingOptionGroup>  <pricingOptionGroup>    <pricingOptionKey>      <pricingOptionKey>RU</pricingOptionKey>    </pricingOptionKey>  </pricingOptionGroup>  <pricingOptionGroup>    <pricingOptionKey>      <pricingOptionKey>RLA</pricingOptionKey>    </pricingOptionKey>  </pricingOptionGroup>  <pricingOptionGroup>    <pricingOptionKey>      <pricingOptionKey>NVO</pricingOptionKey>    </pricingOptionKey>  </pricingOptionGroup></Fare_InformativeBestPricingWithoutPNR></s:Body></s:Envelope>
------------------------------------------------------



---------------------------------------------InformativeBestPricingWithoutPNR Response12.02.57 PM 05-10-2024---------------------------------------------
<?xml version="1.0" encoding="UTF-8"?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:awsse="http://xml.amadeus.com/2010/06/Session_v3" xmlns:wsa="http://www.w3.org/2005/08/addressing"><s:Header><wsa:To>http://www.w3.org/2005/08/addressing/anonymous</wsa:To><wsa:From><wsa:Address>https://nodeD2.production.webservices.amadeus.com/1ASIWFMOFMJ</wsa:Address></wsa:From><wsa:Action>http://webservices.amadeus.com/TIBNRQ_18_1_1A</wsa:Action><wsa:MessageID>urn:uuid:6dc93d90-1269-d744-5df2-428574bb2d28</wsa:MessageID><wsa:RelatesTo RelationshipType="http://www.w3.org/2005/08/addressing/reply">90ba8f24-99ed-4e8a-b397-17d1196928e6</wsa:RelatesTo><awsse:Session TransactionStatusCode="End"><awsse:SessionId>0EF84OSQFR</awsse:SessionId><awsse:SequenceNumber>1</awsse:SequenceNumber><awsse:SecurityToken>3QHOHJ36JW9UXRB3HRRCNJPBY</awsse:SecurityToken></awsse:Session></s:Header><s:Body><Fare_InformativeBestPricingWithoutPNRReply xmlns="http://xml.amadeus.com/TIBNRR_18_1_1A"><messageDetails><messageFunctionDetails><businessFunction>1</businessFunction><messageFunction>741</messageFunction><responsibleAgency>1A</responsibleAgency><additionalMessageFunction>170</additionalMessageFunction></messageFunctionDetails><responseType>A</responseType></messageDetails><mainGroup><dummySegment></dummySegment><convertionRate><conversionRateDetails><rateType>USR</rateType><dutyTaxFeeType>IN</dutyTaxFeeType></conversionRateDetails></convertionRate><pricingGroupLevelGroup><numberOfPax><segmentControlDetails><quantity>1</quantity><numberOfUnits>3</numberOfUnits></segmentControlDetails></numberOfPax><passengersID><travellerDetails><measurementValue>1</measurementValue></travellerDetails><travellerDetails><measurementValue>2</measurementValue></travellerDetails><travellerDetails><measurementValue>3</measurementValue></travellerDetails></passengersID><fareInfoGroup><emptySegment></emptySegment><pricingIndicators><priceTariffType>I</priceTariffType><productDateTimeDetails><departureDate>020624</departureDate></productDateTimeDetails><companyDetails><otherCompany>AI</otherCompany></companyDetails></pricingIndicators><fareAmount><monetaryDetails><typeQualifier>B</typeQualifier><amount>5821</amount><currency>INR</currency></monetaryDetails><otherMonetaryDetails><typeQualifier>712</typeQualifier><amount>6999</amount><currency>INR</currency></otherMonetaryDetails></fareAmount><textData><freeTextQualification><textSubjectQualifier>4</textSubjectQualifier><informationType>15</informationType></freeTextQualification><freeText>02JUN24VNS AI BOM5821.00INR5821.00END</freeText></textData><textData><freeTextQualification><textSubjectQualifier>1</textSubjectQualifier><informationType>1P1</informationType></freeTextQualification><freeText>NON-REFUNDABLE</freeText></textData><textData><freeTextQualification><textSubjectQualifier>1</textSubjectQualifier><informationType>10</informationType></freeTextQualification><freeText>NON ENDORSEABLE VALID ON AI</freeText></textData><textData><freeTextQualification><textSubjectQualifier>1</textSubjectQualifier><informationType>1A49</informationType></freeTextQualification><freeText> - DATE OF ORIGIN</freeText></textData><textData><freeTextQualification><textSubjectQualifier>1</textSubjectQualifier><informationType>1A0</informationType></freeTextQualification><freeText>BAG/SEAT/SERVICES AT A CHARGE MAY BE AVAILABLE-ENTER FXK</freeText></textData><textData><freeTextQualification><textSubjectQualifier>1</textSubjectQualifier><informationType>1A0</informationType></freeTextQualification><freeText>TICKET STOCK RESTRICTION</freeText></textData><textData><freeTextQualification><textSubjectQualifier>1</textSubjectQualifier><informationType>1A0</informationType></freeTextQualification><freeText>BG CXR: AI</freeText></textData><textData><freeTextQualification><textSubjectQualifier>1</textSubjectQualifier><informationType>1A0</informationType></freeTextQualification><freeText>PRICED WITH VALIDATING CARRIER AI - REPRICE IF DIFFERENT VC</freeText></textData><offerReferences><offerIdentifier><uniqueOfferReference>SP09-17723765626974848826-1-OI1-AI1</uniqueOfferReference></offerIdentifier></offerReferences><surchargesGroup><taxesAmount><taxDetails><rate>100</rate><countryCode>YR</countryCode><type>VA</type></taxDetails><taxDetails><rate>70</rate><countryCode>YR</countryCode><type>VB</type></taxDetails><taxDetails><rate>472</rate><countryCode>IN</countryCode><type>DO</type></taxDetails><taxDetails><rate>300</rate><countryCode>K3</countryCode><type>CB</type></taxDetails><taxDetails><rate>236</rate><countryCode>P2</countryCode><type>AF</type></taxDetails></taxesAmount></surchargesGroup><segmentLevelGroup><segmentInformation><flightDate><departureDate>020624</departureDate></flightDate><boardPointDetails><trueLocationId>VNS</trueLocationId></boardPointDetails><offpointDetails><trueLocationId>BOM</trueLocationId></offpointDetails><companyDetails><marketingCompany>AI</marketingCompany></companyDetails><flightIdentification><flightNumber>696</flightNumber><bookingClass>G</bookingClass><operationalSuffix>X</operationalSuffix></flightIdentification><itemNumber>1</itemNumber></segmentInformation><additionalInformation><priceTicketDetails><indicators>LF</indicators></priceTicketDetails><productDateTimeDetails><departureDate>020624</departureDate><arrivalDate>020624</arrivalDate></productDateTimeDetails></additionalInformation><fareBasis><additionalFareDetails><rateClass>GIPYL</rateClass><secondRateClass>G</secondRateClass></additionalFareDetails></fareBasis><cabinGroup><cabinSegment><productDetailsQualifier>ECO</productDetailsQualifier><bookingClassDetails><designator>G</designator><option>M</option></bookingClassDetails></cabinSegment></cabinGroup><baggageAllowance><baggageDetails><freeAllowance>15</freeAllowance><quantityCode>700</quantityCode></baggageDetails></baggageAllowance><ptcSegment><quantityDetails><numberOfUnit>1</numberOfUnit><unitQualifier>ADT</unitQualifier></quantityDetails></ptcSegment></segmentLevelGroup><fareComponentDetailsGroup><fareComponentID><itemNumberDetails><number>1</number><type>FC</type></itemNumberDetails></fareComponentID><marketFareComponent><boardPointDetails><trueLocationId>VNS</trueLocationId></boardPointDetails><offpointDetails><trueLocationId>BOM</trueLocationId></offpointDetails></marketFareComponent><monetaryInformation><monetaryDetails><typeQualifier>TFC</typeQualifier><amount>5821</amount><currency>INR</currency></monetaryDetails></monetaryInformation><componentClassInfo><fareBasisDetails><rateTariffClass>GIPYL</rateTariffClass></fareBasisDetails></componentClassInfo><fareQualifiersDetail><discountDetails><fareQualifier>BOR</fareQualifier></discountDetails></fareQualifiersDetail><couponDetailsGroup><productId><referenceDetails><type>ST</type><value>1</value></referenceDetails></productId></couponDetailsGroup></fareComponentDetailsGroup></fareInfoGroup></pricingGroupLevelGroup></mainGroup></Fare_InformativeBestPricingWithoutPNRReply></s:Body></s:Envelope>
------------------------------------------------------



---------------------------------------------Original response12.02.57 PM 05-10-2024---------------------------------------------
{"responseStatus":{"status":1,"message":"Success","Error_Code":null,"Error_Desc":null,"Error_InnerException":null},"fare":{"FB_flight_id":0,"FB_static":null,"tboResultIndex":null,"Tgy_FareID":null,"tjID":null,"refundType":0,"FareType":0,"mojoFareType":0,"cabinType":0,"bookingClass":null,"baggageInfo":null,"Currency":null,"NetFare":20997.0,"PublishedFare":0.0,"grandTotal":20997.0,"ShowFare":0.0,"BaseFare":17463.0,"Tax":3534.0,"YQTax":0.0,"AdditionalTxnFeePub":0.0,"AdditionalTxnFeeOfrd":0.0,"OtherCharges":0.0,"CommissionEarned":0.0,"PGCharge":0.0,"Discount":0.0,"OfferedFare":0.0,"TdsOnCommission":0.0,"TdsOnPLB":0.0,"TdsOnIncentive":0.0,"ServiceFee":0.0,"GST":0.0,"Markup":0.0,"fareBreakdown":[{"PassengerType":1,"BaseFare":5821.0,"Tax":1178.0,"YQTax":0.0,"AdditionalTxnFeePub":0.0,"AdditionalTxnFeeOfrd":0.0,"PGCharge":0.0,"Markup":0.0,"CommissionEarned":0.0,"TdsOnCommission":0.0,"GST":0.0,"ServiceFee":0.0,"OtherCharges":0.0,"Discount":0.0}],"markupID":null,"ffDiscount":0.0,"ConvenienceFee":0.0,"SeatAvailable":0,"isBlock":false,"gdsType":0,"subProvider":0,"scComprefare":0.0,"cgstax":0.0,"igstax":0.0,"sgstax":0.0,"flat":0.0,"additionalTxnFeeOfrd":0.0,"additionalTxnFeePub":0.0,"artGST":0.0,"artGSTOnMFee":0.0,"artTDS":0.0,"pLBEarned":0.0,"incentiveEarned":0.0,"artIncentive":0.0,"totalBaggageCharges":0.0,"totalMealCharges":0.0,"totalSeatCharges":0.0,"totalSpecialServiceCharges":0.0,"transactionFee":0.0,"managementFee":0.0,"cGSTax":0.0,"sGSTax":0.0,"iGSTax":0.0,"feeSurcharges":0.0,"instantDiscontOnFare":0.0,"publishedFareSoldInSwapping":0.0,"taxSoldInSwapping":0.0,"baseFareSoldInSwapping":0.0,"instantDiscountSoldInSwapping":0.0,"yqSoldInSwapping":0.0,"isFareSwapped":false,"ST_ResultSessionID":null,"AQ_ticket_id":null,"E2F_id":0,"d_owner":null,"FlightKey":null,"GFS_FlightKey":null}}
------------------------------------------------------



